### Pandas 
pandas is a library for data analysis such as reading,writing,processing and analyzing, visualizing the data


#### Pandas can be declared two types:

* Series
* DataFrame

Series is a panda package for displaying data in 1D array


DataFrame is also panda package for displaying data in 2D array
 
 ##### to install pandas
 ###### pip install pandas

In [2]:
import pandas as pd
s=pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
import pandas as pd
s=pd.Series([10.4,20,30,40])
s

0    10.4
1    20.0
2    30.0
3    40.0
dtype: float64

In [4]:
import pandas as pd
s=pd.Series(['chinna',20.5,30,40])
s

0    chinna
1      20.5
2        30
3        40
dtype: object

In [5]:
type(s)

pandas.core.series.Series

In [6]:
import pandas as pd
s=pd.Series([10,20,30],[1,2,3])
s

1    10
2    20
3    30
dtype: int64

In [8]:
s=pd.Series([[1,2,3],[4,5,6]])
s

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [9]:
s={1,23,4}
s1=pd.Series(s)
s1

TypeError: 'set' type is unordered

In [10]:
# Data Frame
l=[10,20,30,40]
df=pd.DataFrame(l)
df

    0
0  10
1  20
2  30
3  40

In [11]:
l=[[10,20],[30,40],[50,60]]
df=pd.DataFrame(l)
df

    0   1
0  10  20
1  30  40
2  50  60

In [12]:
l=[("vr",45),("siva",34),("chinnu",98)]
df=pd.DataFrame(l)
df

        0   1
0      vr  45
1    siva  34
2  chinnu  98

In [15]:
import numpy as np
a=np.array([10,20])
df=pd.DataFrame(a)
df

    0
0  10
1  20

In [16]:
import numpy as np
a=np.arange(8).reshape(2,4)
df=pd.DataFrame(a)
df

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [17]:
l=[("vr",45),("siva",34),("chinnu",98)]
df=pd.DataFrame(l,columns=["name",'Marks'])
df

     name  Marks
0      vr     45
1    siva     34
2  chinnu     98

In [19]:
l=[("vr",45),("siva",34),("chinnu",98)]
df=pd.DataFrame(l)
df.columns=['name','marks']
df

     name  marks
0      vr     45
1    siva     34
2  chinnu     98

In [2]:
import pandas as pd
l=[]
for i in range(3):
    n=input("enter name")
    l.append(n)

df=pd.DataFrame(l,columns=["Name"])
df

enter namechinnu
enter namechina
enter namedevi

     Name
0  chinnu
1   china
2    devi

In [3]:
d={"name":['a','b','c'],"age":[12,34,13],"Marks":[50,60,70]}

df=pd.DataFrame(d)
df

  name  age  Marks
0    a   12     50
1    b   34     60
2    c   13     70

In [4]:
df["name"]

0    a
1    b
2    c
Name: name, dtype: object

In [5]:
df[["name"]]

  name
0    a
1    b
2    c

In [10]:
df[["age","Marks"]]

   age  Marks
0   12     50
1   34     60
2   13     70

In [13]:
df[2:]

  name  age  Marks
2    c   13     70

In [23]:
#loc and iloc
d={"s.no":[100,102,103],"sname":["a",'b','c'],"smarks":[40,59,48]}
df=pd.DataFrame(d)
print(df)
print(df.set_index("s.no"))
df=df.set_index("s.no")
df

   s.no sname  smarks
0   100     a      40
1   102     b      59
2   103     c      48
     sname  smarks
s.no
100      a      40
102      b      59
103      c      48

     sname  smarks
s.no
100      a      40
102      b      59
103      c      48

In [25]:
df.iloc[0:2]

     sname  smarks
s.no
100      a      40
102      b      59

In [26]:
df.iloc[0:3,1:]

      smarks
s.no
100       40
102       59
103       48

In [31]:
df.loc[102:]

     sname  smarks
s.no
102      b      59
103      c      48

In [33]:
df.loc[101:103,'sname':]

     sname  smarks
s.no
102      b      59
103      c      48

In [34]:
df.reset_index(inplace=True)

In [35]:
df

   s.no sname  smarks
0   100     a      40
1   102     b      59
2   103     c      48

In [36]:
df.drop('smarks',axis=1)

   s.no sname
0   100     a
1   102     b
2   103     c

In [54]:
df.drop(2)

   s.no sname  smarks  average
0   100     a      40     0.40
1   102     b      59     0.59
3   104     d      60     0.60
4   104     d      60     0.60

In [55]:
d={"s.no":[100,102,103],"sname":["a",'b','c'],"smarks":[40,59,48]}
df=pd.DataFrame(d)
print(df)

   s.no sname  smarks
0   100     a      40
1   102     b      59
2   103     c      48

In [56]:
df[df['smarks']>45]

   s.no sname  smarks
1   102     b      59
2   103     c      48

In [57]:
df[(df['sname']=='a')& (df['smarks']>=40)]

   s.no sname  smarks
0   100     a      40

In [58]:
#add a new column
df['average']=df['smarks']/100
df

   s.no sname  smarks  average
0   100     a      40     0.40
1   102     b      59     0.59
2   103     c      48     0.48

In [59]:
d={'s.no':104,'sname':'d','smarks':60,'average':0.60}
df=df.append(d,ignore_index=True)
df

   s.no sname  smarks  average
0   100     a      40     0.40
1   102     b      59     0.59
2   103     c      48     0.48
3   104     d      60     0.60

In [60]:
df=pd.read_csv('Automobile_data.csv')

In [61]:
df.head()

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450